arc/cf/Catalogs/Патчи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Патчи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Проекты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ошибка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Ошибки</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделПроекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыПроекта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проверяющий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аудитор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторИсправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СостоянияПроверкиПатча</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Роль</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВерсияПатча</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВерсииПроекта</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПроверки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выполнил</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторПатча</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

arc/cf/Catalogs/Патчи/Forms/ПодтверждениеПроверкиПатча/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Инструкция = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.Проект, "ИнструкцияПоПроверкеПатча");
	Если ЗначениеЗаполнено(Инструкция) Тогда
		Инструкция = ОбщегоНазначения.ЗначениеИзСтрокиXML(Инструкция);
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Инструкция) Тогда
		Инструкция = Новый ФорматированнаяСтрока(ПатчиСлужебный.ИнструкцияПроверкиПатча());
	КонецЕсли;
	
	АвторИсправления = Параметры.АвторИсправления;
	ЗамещаетРазработчика = Параметры.ЗамещаетРазработчика;
	
	Элементы.ИнструкцияПроверкиПатча.Высота = СтрЧислоСтрок(Инструкция) + 1;
	
	ИнструкцияПроверкиПатча.УстановитьФорматированнуюСтроку(Инструкция);
	
	НужноУказатьПроверяющего = Параметры.НужноУказатьПроверяющего;
	НужноУказатьАудитора = Параметры.НужноУказатьАудитора;
	
	Элементы.АудитВыполняетПроверяющий.Видимость = НужноУказатьПроверяющего И НужноУказатьАудитора;
	
	Элементы.Проверяющий.Видимость = НужноУказатьПроверяющего;
	Элементы.Аудитор.Видимость = НужноУказатьАудитора;
	
	Ключ = "ПроверкаПатча";
	Если НужноУказатьПроверяющего Тогда
		Ключ = "Проверяющий";
	ИначеЕсли НужноУказатьАудитора Тогда
		Ключ = "Аудитор";
	КонецЕсли;
	
	Если НужноУказатьПроверяющего И НужноУказатьАудитора Тогда
		Ключ = Ключ + "Аудитор";
	КонецЕсли;
	
	Ключ = Ключ + Строка(Элементы.ИнструкцияПроверкиПатча.Высота);
	
	СтандартныеПодсистемыСервер.УстановитьКлючНазначенияФормы(ЭтотОбъект, Ключ);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	Если Не НужноУказатьПроверяющего Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Проверяющий"));
	КонецЕсли;
	
	Если Не НужноУказатьАудитора Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Аудитор"));
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПроверяющийОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ВыбранноеЗначение = АвторИсправления Или ВыбранноеЗначение = ЗамещаетРазработчика Тогда
		СтандартнаяОбработка = Ложь;
		Предупреждение = НСтр("ru = 'Проверяющим не может быть автор исправления или разработчик, выполнивший первоначальную проверку патча.'");
		ПоказатьПредупреждение(, Предупреждение);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура АудиторОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ВыбранноеЗначение = АвторИсправления Тогда
		СтандартнаяОбработка = Ложь;
		Предупреждение = НСтр("ru = 'Аудитором не может быть автор исправления или разработчик, выполнивший первоначальную проверку патча.'");
		ПоказатьПредупреждение(, Предупреждение);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПроверяющийПриИзменении(Элемент)
	Если АудитВыполняетПроверяющий Тогда
		Аудитор = Проверяющий;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура АудитВыполняетПроверяющийПриИзменении(Элемент)
	Если АудитВыполняетПроверяющий Тогда
		Элементы.Аудитор.Вид = ВидПоляФормы.ПолеНадписи;
		Аудитор = Проверяющий;
	Иначе
		Элементы.Аудитор.Вид = ВидПоляФормы.ПолеВвода;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПатчПроверен(Команда)
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("ПатчПроверен", Истина);
	Если НужноУказатьПроверяющего Тогда
		Результат.Вставить("Проверяющий", Проверяющий);
	КонецЕсли;
	Если НужноУказатьАудитора Тогда
		Результат.Вставить("Аудитор", Аудитор);
	КонецЕсли;
	
	Закрыть(Результат);
КонецПроцедуры

#КонецОбласти
